tests/resources/webpayment/doWebPayment/doWebPaymentRequest.xml

<?xml version="1.0" encoding="UTF-8"?>
<SOAP-ENV:Envelope xmlns:SOAP-ENV="http://schemas.xmlsoap.org/soap/envelope/" xmlns:ns1="http://impl.ws.payline.experian.com" xmlns:ns2="http://obj.ws.payline.experian.com" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance">
    <SOAP-ENV:Body>
        <ns1:doWebPaymentRequest>
            <ns1:version>90</ns1:version>
            <ns1:payment>
                <ns2:amount>1000</ns2:amount>
                <ns2:currency>978</ns2:currency>
                <ns2:action>100</ns2:action>
                <ns2:mode>CPT</ns2:mode>
                <ns2:contractNumber>CB</ns2:contractNumber>
                <ns2:differedActionDate>DiffActDate 11/11/2011</ns2:differedActionDate>
                <ns2:method>Method</ns2:method>
                <ns2:softDescriptor xsi:nil="true"/>
                <ns2:cardBrand>VISA</ns2:cardBrand>
                <ns2:registrationToken xsi:nil="true"/>
                <ns2:cumulatedAmount xsi:nil="true"/>
            </ns1:payment>
            <ns1:returnURL>https://Demo_Shop.com/returnURL.php</ns1:returnURL>
            <ns1:cancelURL>https://Demo_Shop.com/cancelURL.php</ns1:cancelURL>
            <ns1:order>
                <ns2:ref>myOrderRef_35656</ns2:ref>
                <ns2:origin>BIGBANG</ns2:origin>
                <ns2:country>FRANCE</ns2:country>
                <ns2:taxes>50%</ns2:taxes>
                <ns2:amount>1000</ns2:amount>
                <ns2:currency>978</ns2:currency>
                <ns2:date>15/12/2014 12:20</ns2:date>
                <ns2:details/>
                <ns2:deliveryTime>entre 6h et 22h</ns2:deliveryTime>
                <ns2:deliveryMode>Par camion</ns2:deliveryMode>
                <ns2:deliveryExpectedDate>Demain</ns2:deliveryExpectedDate>
                <ns2:deliveryExpectedDelay>200</ns2:deliveryExpectedDelay>
                <ns2:deliveryCharge>DeliveryChareg 8</ns2:deliveryCharge>
                <ns2:discountAmount xsi:nil="true"/>
                <ns2:otaPackageType xsi:nil="true"/>
                <ns2:otaDestinationCountry xsi:nil="true"/>
                <ns2:bookingReference>BookingRef ppp</ns2:bookingReference>
                <ns2:orderDetail>OrderDetails 9999</ns2:orderDetail>
                <ns2:orderExtended xsi:nil="true"/>
                <ns2:orderOTA>OrderOTA supp</ns2:orderOTA>
            </ns1:order>
            <ns1:notificationURL>https://Demo_Shop.com/notificationURL.php</ns1:notificationURL>
            <ns1:selectedContractList/>
            <ns1:secondSelectedContractList xsi:nil="true"/>
            <ns1:privateDataList/>
            <ns1:languageCode>FR_fr</ns1:languageCode>
            <ns1:customPaymentPageCode>PloufXX</ns1:customPaymentPageCode>
            <ns1:buyer>
                <ns2:title>Maitre de lunivers</ns2:title>
                <ns2:lastName>lastname</ns2:lastName>
                <ns2:firstName>firstname </ns2:firstName>
                <ns2:email>toto@fait.dubateau </ns2:email>
                <ns2:shippingAdress>
                    <ns2:title>Maitre de lunivers</ns2:title>
                    <ns2:name>name shipping</ns2:name>
                    <ns2:firstName>firstname shipping</ns2:firstName>
                    <ns2:lastName>lastnameshipping</ns2:lastName>
                    <ns2:street1>123 rue de nowhere</ns2:street1>
                    <ns2:street2>Street 2 nowhere</ns2:street2>
                    <ns2:streetNumber>999</ns2:streetNumber>
                    <ns2:cityName>city shipping</ns2:cityName>
                    <ns2:zipCode>11000</ns2:zipCode>
                    <ns2:country>FR</ns2:country>
                    <ns2:phone>000000000</ns2:phone>
                    <ns2:state>LA</ns2:state>
                    <ns2:county>FR</ns2:county>
                    <ns2:phoneType>Nokia3310 shipping</ns2:phoneType>
                    <ns2:addressCreateDate>00/00/0000</ns2:addressCreateDate>
                    <ns2:email>toto@fait.dubateau shipping</ns2:email>
                </ns2:shippingAdress>
                <ns2:billingAddress>
                    <ns2:title>Maitre de lunivers</ns2:title>
                    <ns2:name>name billing</ns2:name>
                    <ns2:firstName>firstname billing</ns2:firstName>
                    <ns2:lastName>lastnamebilling</ns2:lastName>
                    <ns2:street1>123 rue de nowhere</ns2:street1>
                    <ns2:street2>Street 2 nowhere</ns2:street2>
                    <ns2:streetNumber>999</ns2:streetNumber>
                    <ns2:cityName>city billing</ns2:cityName>
                    <ns2:zipCode>11000</ns2:zipCode>
                    <ns2:country>FR</ns2:country>
                    <ns2:phone>000000000</ns2:phone>
                    <ns2:state>LA</ns2:state>
                    <ns2:county>FR</ns2:county>
                    <ns2:phoneType>Nokia3310 billing</ns2:phoneType>
                    <ns2:addressCreateDate>00/00/0000</ns2:addressCreateDate>
                    <ns2:email>toto@fait.dubateau billing</ns2:email>
                </ns2:billingAddress>
                <ns2:accountCreateDate xsi:nil="true"/>
                <ns2:accountAverageAmount xsi:nil="true"/>
                <ns2:accountOrderCount xsi:nil="true"/>
                <ns2:walletId>xxx222</ns2:walletId>
                <ns2:walletDisplayed>Wallet XX</ns2:walletDisplayed>
                <ns2:walletSecured xsi:nil="true"/>
                <ns2:walletCardInd>2</ns2:walletCardInd>
                <ns2:ip>127.0.0.69</ns2:ip>
                <ns2:mobilePhone>060000000</ns2:mobilePhone>
                <ns2:customerId>customerId</ns2:customerId>
                <ns2:legalStatus>pacs</ns2:legalStatus>
                <ns2:legalDocumentType>papier</ns2:legalDocumentType>
                <ns2:legalDocument>le papier</ns2:legalDocument>
                <ns2:birthDate>01/01/1900</ns2:birthDate>
                <ns2:fingerprintID>aaa-aaa-aaa</ns2:fingerprintID>
                <ns2:deviceFingerprint>deviceFingerprint</ns2:deviceFingerprint>
                <ns2:isBot>true</ns2:isBot>
                <ns2:isIncognito>true</ns2:isIncognito>
                <ns2:isBehindProxy>true</ns2:isBehindProxy>
                <ns2:isFromTor>true</ns2:isFromTor>
                <ns2:isEmulator>true</ns2:isEmulator>
                <ns2:isRooted>true</ns2:isRooted>
                <ns2:hasTimezoneMismatch>jesaispas</ns2:hasTimezoneMismatch>
                <ns2:loyaltyMemberType>true</ns2:loyaltyMemberType>
                <ns2:buyerExtended>buyerExt</ns2:buyerExtended>
                <ns2:merchantAuthentication>
                    <ns2:method xsi:nil="true"/>
                    <ns2:date xsi:nil="true"/>
                </ns2:merchantAuthentication>
            </ns1:buyer>
            <ns1:owner>
                <ns2:lastName>lastname owner</ns2:lastName>
                <ns2:firstName>firstname owner</ns2:firstName>
                <ns2:billingAddress xsi:type="ns2:billingAddress">
                    <street/>
                    <cityName>city billing</cityName>
                    <zipCode>11000</zipCode>
                    <country>FR</country>
                    <phone>000000000</phone>
                </ns2:billingAddress>
                <ns2:issueCardDate>15/12/2020 10:00</ns2:issueCardDate>
            </ns1:owner>
            <ns1:securityMode>XX</ns1:securityMode>
            <ns1:recurring>
                <ns2:firstAmount>30</ns2:firstAmount>
                <ns2:amount>100</ns2:amount>
                <ns2:billingCycle>12</ns2:billingCycle>
                <ns2:billingLeft>20</ns2:billingLeft>
                <ns2:billingDay>5</ns2:billingDay>
                <ns2:startDate>01/01/2020 10:00</ns2:startDate>
                <ns2:endDate>01/01/2122 10:00</ns2:endDate>
                <ns2:newAmount>40000</ns2:newAmount>
                <ns2:amountModificationDate>02/01/2020 10:00</ns2:amountModificationDate>
                <ns2:billingRank>12</ns2:billingRank>
            </ns1:recurring>
            <ns1:customPaymentTemplateURL>PloufXXUrl</ns1:customPaymentTemplateURL>
            <ns1:contractNumberWalletList/>
            <ns1:merchantName>Balthazar Picsou</ns1:merchantName>
            <ns1:subMerchant>
                <ns2:subMerchantId/>
                <ns2:subMerchantName>subMerchantName 1</ns2:subMerchantName>
                <ns2:subMerchantMCC/>
                <ns2:subMerchantSIRET>subMerchantSIRET 2</ns2:subMerchantSIRET>
                <ns2:subMerchantTaxCode>subMerchantTaxCode 3</ns2:subMerchantTaxCode>
                <ns2:subMerchantStreet>subMerchantStreet 4 nowhere</ns2:subMerchantStreet>
                <ns2:subMerchantCity>subMerchantCity 5</ns2:subMerchantCity>
                <ns2:subMerchantZipCode>subMerchantZipCode 6</ns2:subMerchantZipCode>
                <ns2:subMerchantCountry>subMerchantCountry 7 FR</ns2:subMerchantCountry>
                <ns2:subMerchantState>subMerchantState 8</ns2:subMerchantState>
                <ns2:subMerchantEmailAddress>subMerchantEmailAddress 9</ns2:subMerchantEmailAddress>
                <ns2:subMerchantPhoneNumber>subMerchantPhoneNumber 10</ns2:subMerchantPhoneNumber>
            </ns1:subMerchant>
            <ns1:miscData>miscData value</ns1:miscData>
            <ns1:asynchronousRetryTimeout>async 100</ns1:asynchronousRetryTimeout>
            <ns1:threeDSInfo>
                <ns2:challengeInd>1</ns2:challengeInd>
                <ns2:threeDSReqPriorAuthData>ThreeDSReqPriorAuthData</ns2:threeDSReqPriorAuthData>
                <ns2:threeDSReqPriorAuthMethod>threeDSReqPriorAuthMethod</ns2:threeDSReqPriorAuthMethod>
                <ns2:threeDSReqPriorAuthTimestamp>threeDSReqPriorAuthTimestamp</ns2:threeDSReqPriorAuthTimestamp>
                <ns2:browser>
                    <ns2:acceptHeader>header</ns2:acceptHeader>
                    <ns2:javaEnabled>javaTrus</ns2:javaEnabled>
                    <ns2:javascriptEnabled>jsTrue</ns2:javascriptEnabled>
                    <ns2:language>Fr</ns2:language>
                    <ns2:colorDepth>colorDepth</ns2:colorDepth>
                    <ns2:screenHeight>500</ns2:screenHeight>
                    <ns2:screenWidth>400</ns2:screenWidth>
                    <ns2:timeZoneOffset>GMT+5</ns2:timeZoneOffset>
                    <ns2:userAgent>Mozilla/5.0 (Windows NT 10.0; Win64; x64) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/119.0.0.0 Safari/537.36</ns2:userAgent>
                </ns2:browser>
                <ns2:sdk>
                    <ns2:deviceRenderingOptionsIF>deviceRenderingOptionsIF9</ns2:deviceRenderingOptionsIF>
                    <ns2:deviceRenderOptionsUI>deviceRenderOptionsUI8</ns2:deviceRenderOptionsUI>
                    <ns2:appID>appID7</ns2:appID>
                    <ns2:ephemPubKey>ephemPubKey6</ns2:ephemPubKey>
                    <ns2:maxTimeout>10</ns2:maxTimeout>
                    <ns2:referenceNumber>referenceNumber5</ns2:referenceNumber>
                    <ns2:transID>transID4</ns2:transID>
                    <ns2:encData>encData3</ns2:encData>
                </ns2:sdk>
                <ns2:threeDSMethodNotificationURL>threeDSMethodNotificationURL</ns2:threeDSMethodNotificationURL>
                <ns2:threeDSMethodResult>threeDSMethodResult</ns2:threeDSMethodResult>
                <ns2:challengeWindowSize>500px</ns2:challengeWindowSize>
            </ns1:threeDSInfo>
            <ns1:merchantScore>merchantScore 0</ns1:merchantScore>
            <ns1:skipSmartDisplay xsi:nil="true"/>
        </ns1:doWebPaymentRequest>
    </SOAP-ENV:Body>
</SOAP-ENV:Envelope>